In [70]:
print("Hello World")

Hello World

Step1 Data Exploration and Loading

In [71]:
!pip install pandas

Requirement already satisfied: pandas in d:\project-walmart\my_env1\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in d:\project-walmart\my_env1\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\project-walmart\my_env1\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\project-walmart\my_env1\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in d:\project-walmart\my_env1\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in d:\project-walmart\my_env1\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [72]:
!pip install pymysql

Requirement already satisfied: pymysql in d:\project-walmart\my_env1\lib\site-packages (1.1.1)

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [73]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in d:\project-walmart\my_env1\lib\site-packages (2.0.38)
Requirement already satisfied: greenlet!=0.4.17 in d:\project-walmart\my_env1\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in d:\project-walmart\my_env1\lib\site-packages (from sqlalchemy) (4.12.2)

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [74]:

#Importing Dependenice
import pandas as pd 
import pymysql #pymysql is a pure-Python MySQL client library used to connect Python applications to a MySQL database.
#sqlalchemy is SQL toolkit and ORM (Object Relational Mapper) for Python.
#create_engine is used to create a database connection engine, allowing easy interaction with databases using SQL or ORM features.
from sqlalchemy import create_engine

In [75]:
# Reading the csv file and used encoding_errors to handle encoding issues while reading a CSV file.
df = pd.read_csv("D:\\Project-WalMart\\my_env1\\Walmart.csv", encoding_errors='ignore')
df.shape

(10051, 11)

In [76]:
df.head() #It will give as the first five rows

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [77]:
df.describe() #It is give as some statistics

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [78]:
df.info() #It will give datatypes and other information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [79]:
#It shows all duplicates
df.duplicated().sum()

np.int64(51)

In [80]:
#it is used to remove the duplicates
df.drop_duplicates(inplace = True)
df.duplicated().sum()

np.int64(0)

In [81]:
# It is used to check for missing (null/NaN) values in each column of a DataFrame.
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [82]:
#It is used to remove rows (or columns) that contain missing values (NaN) directly in the DataFrame.
df.dropna(inplace=True)
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [83]:
df.shape

(9969, 11)

In [84]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [85]:
#Replacing the dollar sign, converting the data type to float, and updating the DataFrame.
df["unit_price"] =  df['unit_price'].str.replace("$","").astype(float)

In [86]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [87]:
#
df["total"] = df['unit_price'] * df['quantity']
df.head(1)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83

In [88]:
#mysql
#host = localhost
#port = 3306 
#user = root 
#password = "Santhu@0987"

In [89]:
df.shape

(9969, 12)

In [90]:
#it is used to save the data which is cleaned 
df.to_csv('walmart_clean_data.csv',index = False)

In [91]:
#help(df.to_sql)

In [101]:
#mysql connections 
engine_mysql = create_engine("mysql+pymysql://root:Santhu0987@localhost:3306/walmart_db") 
try:
    engine_mysql
    print("Connection Successed to MySql") 
except:
    print("Unable to connect")

Connection Successed to MySql

In [102]:
df.to_sql(name="walmart",con=engine_mysql,if_exists="append",index=False)

9969

In [98]:
df.shape

(9969, 12)